In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data={
    'Name': ['Ahmed', ' Sara', 'Ahmed', 'Mona', 'khaled '],
    'Age': [25, 22, 25, np.nan, 200],
    'City': ['Cairo', 'Dubai', 'Cairo', 'DUBAI', 'Riyadh'],
    'Salary': ['5000', '7000', '5000', 'missing', '4000']}
df=pd.DataFrame(data)
df

      Name    Age    City   Salary
0    Ahmed   25.0   Cairo     5000
1     Sara   22.0   Dubai     7000
2    Ahmed   25.0   Cairo     5000
3     Mona    NaN   DUBAI  missing
4  khaled   200.0  Riyadh     4000

In [4]:
df.fillna(0,inplace=True)
df

      Name    Age    City   Salary
0    Ahmed   25.0   Cairo     5000
1     Sara   22.0   Dubai     7000
2    Ahmed   25.0   Cairo     5000
3     Mona    0.0   DUBAI  missing
4  khaled   200.0  Riyadh     4000

In [6]:
df['City']=df['City'].str.strip().str.capitalize()
df

      Name    Age    City   Salary
0    Ahmed   25.0   Cairo     5000
1     Sara   22.0   Dubai     7000
2    Ahmed   25.0   Cairo     5000
3     Mona    0.0   Dubai  missing
4  khaled   200.0  Riyadh     4000

In [8]:
df['Name']=df['Name'].str.strip()
df

     Name    Age    City   Salary
0   Ahmed   25.0   Cairo     5000
1    Sara   22.0   Dubai     7000
2   Ahmed   25.0   Cairo     5000
3    Mona    0.0   Dubai  missing
4  khaled  200.0  Riyadh     4000

In [10]:
df['Age']=df['Age'].astype(int)
df

     Name  Age    City   Salary
0   Ahmed   25   Cairo     5000
1    Sara   22   Dubai     7000
2   Ahmed   25   Cairo     5000
3    Mona    0   Dubai  missing
4  khaled  200  Riyadh     4000

In [11]:
df['Age']=df['Age'].replace(0, df['Age'].median())
df

     Name  Age    City   Salary
0   Ahmed   25   Cairo     5000
1    Sara   22   Dubai     7000
2   Ahmed   25   Cairo     5000
3    Mona   25   Dubai  missing
4  khaled  200  Riyadh     4000

In [14]:
df.loc[df['Age'] > 100, 'Age']= df['Age'].median()

In [15]:
df

     Name  Age    City   Salary
0   Ahmed   25   Cairo     5000
1    Sara   22   Dubai     7000
2   Ahmed   25   Cairo     5000
3    Mona   25   Dubai  missing
4  khaled   25  Riyadh     4000

In [16]:
df['Salary']=pd.to_numeric(df['Salary'],errors='coerce')
df

     Name  Age    City  Salary
0   Ahmed   25   Cairo  5000.0
1    Sara   22   Dubai  7000.0
2   Ahmed   25   Cairo  5000.0
3    Mona   25   Dubai     NaN
4  khaled   25  Riyadh  4000.0

In [17]:
df['Salary']=df['Salary'].fillna(df['Salary'].mean())
df

     Name  Age    City  Salary
0   Ahmed   25   Cairo  5000.0
1    Sara   22   Dubai  7000.0
2   Ahmed   25   Cairo  5000.0
3    Mona   25   Dubai  5250.0
4  khaled   25  Riyadh  4000.0

In [18]:
df['Salary']=df['Salary'].apply(lambda x:"{:,.0f}".format(x))
df

     Name  Age    City Salary
0   Ahmed   25   Cairo  5,000
1    Sara   22   Dubai  7,000
2   Ahmed   25   Cairo  5,000
3    Mona   25   Dubai  5,250
4  khaled   25  Riyadh  4,000